linux/paperwork/unit-plan.org
#+TITLE:     《Linux应用基础》教案
#+AUTHOR:    王晓林
#+EMAIL:     wx672ster@gmail.com
#+DATE:      2012-08-18 Wed
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  cn
#+OPTIONS:   H:4 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs2.swfu.edu.cn/org-info-js/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

# (setq org-export-html-use-infojs nil)

#+LaTeX: \clearpage
- 课程名称: Linux应用基础
- 面向专业: 计算机相关本科专业
- 教材参考：Mendel Cooper, /Advanced Bash Scripting Guide 5.3 Volume 1/, 2010
- 授课学期：大一～大三
- 任课教师：王晓林
- 编写时间：[2012-08-18 Sat]
* Linux introduction 
** 教学目标及基本要求
   了解什么是Linux, GNU, Opensource
** 教学内容及学时分配
   - [[./linux_intro/linux_intro.pdf][幻灯片]]
*** What's GNU/Linux? (0.5h)
**** 教学内容（具体到知识点）
     - What's Linux?
     - What's GNU?
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
     课堂讲授，课后答疑
*** Opensource history and future (0.5h)
**** 教学内容（具体到知识点）
     - What's opensource?
     - History and future
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
     课堂讲授，课后答疑
** 重点和难点
   - What's GNU/Linux
   - Opensource
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   - 理论 + 实验
** 参考书目						   :noexport:
** 思考题和习题							   :noexport:
* Play with bash
** 教学目标及基本要求
   了解基本的命令行操作和shell编程
** 教学内容及学时分配
  - [[./bash/shell_basics.html][讲义]]
  - [[./linux_lectures/][幻灯片]]
*** UNIX file system (1h)
**** 教学内容（具体到知识点）
     - UNIX file system structure
     - basic commands
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Terminal operations (.5h)
**** 教学内容（具体到知识点）
     - CLI shortcuts
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** File operations (1h)
**** 教学内容（具体到知识点）
     - understanding =ls= output
     - copy, move, delete, view, link
     - cat
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Shell basics (1h)
**** 教学内容（具体到知识点）
     - Help
     - Path
     - Initial files
     - Special files
     - Special characters
     - Search
     - Alias
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
