linux/paperwork/unit-plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="cn" xml:lang="cn">
<head>
<title>《Linux应用基础》教案</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="《Linux应用基础》教案"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-18 Wed"/>
<meta name="author" content="王晓林"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">《Linux应用基础》教案</h1>


<ul>
<li>课程名称: Linux应用基础
</li>
<li>面向专业: 计算机相关本科专业
</li>
<li>教材参考：Mendel Cooper, <i>Advanced Bash Scripting Guide 5.3 Volume 1</i>, 2010
</li>
<li>授课学期：大一～大三
</li>
<li>任课教师：王晓林
</li>
<li>编写时间： <span class="timestamp-wrapper"> <span class="timestamp">2012-08-18 Sat</span></span>
</li>
</ul>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Linux introduction</a>
<ul>
<li><a href="#sec-1-1">1.1 教学目标及基本要求</a></li>
<li><a href="#sec-1-2">1.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 What's GNU/Linux? (0.5h)</a>
<ul>
<li><a href="#sec-1-2-1-1">1.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-1-2-1-2">1.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-1-2-2">1.2.2 Opensource history and future (0.5h)</a>
<ul>
<li><a href="#sec-1-2-2-1">1.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-1-2-2-2">1.2.2.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 重点和难点</a></li>
<li><a href="#sec-1-4">1.4 深化和拓宽</a></li>
<li><a href="#sec-1-5">1.5 教学方式（手段）及教学过程中应注意的问题</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Play with bash</a>
<ul>
<li><a href="#sec-2-1">2.1 教学目标及基本要求</a></li>
<li><a href="#sec-2-2">2.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 UNIX file system (1h)</a>
<ul>
<li><a href="#sec-2-2-1-1">2.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-1-2">2.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-2">2.2.2 Terminal operations (.5h)</a>
<ul>
<li><a href="#sec-2-2-2-1">2.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-2-2">2.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-3">2.2.3 File operations (1h)</a>
<ul>
<li><a href="#sec-2-2-3-1">2.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-3-2">2.2.3.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-4">2.2.4 Shell basics (1h)</a>
<ul>
<li><a href="#sec-2-2-4-1">2.2.4.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-4-2">2.2.4.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-5">2.2.5 Bash programming (4h)</a>
<ul>
<li><a href="#sec-2-2-5-1">2.2.5.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-5-2">2.2.5.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-2-2-6">2.2.6 Sed, Awk (2h)</a>
<ul>
<li><a href="#sec-2-2-6-1">2.2.6.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-2-2-6-2">2.2.6.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 重点和难点</a></li>
<li><a href="#sec-2-4">2.4 深化和拓宽</a></li>
<li><a href="#sec-2-5">2.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-2-6">2.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Classical Linux IDE</a>
<ul>
<li><a href="#sec-3-1">3.1 教学目标及基本要求</a></li>
<li><a href="#sec-3-2">3.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 From c source code to executable (1h)</a>
<ul>
<li><a href="#sec-3-2-1-1">3.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-1-2">3.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-3-2-2">3.2.2 Emacs + GCC + GDB (2h)</a>
<ul>
<li><a href="#sec-3-2-2-1">3.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-2-2">3.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-3-2-3">3.2.3 make and version control (2.5h)</a>
<ul>
<li><a href="#sec-3-2-3-1">3.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-3-2-3-2">3.2.3.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 重点和难点</a></li>
<li><a href="#sec-3-4">3.4 深化和拓宽</a></li>
<li><a href="#sec-3-5">3.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-3-6">3.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-4">4 system administration</a>
<ul>
<li><a href="#sec-4-1">4.1 教学目标及基本要求</a></li>
<li><a href="#sec-4-2">4.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 debian/ubuntu package management (2h)</a>
<ul>
<li><a href="#sec-4-2-1-1">4.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-4-2-1-2">4.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-4-2-2">4.2.2 system maintenance (2h)</a>
<ul>
<li><a href="#sec-4-2-2-1">4.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-4-2-2-2">4.2.2.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 重点和难点</a></li>
<li><a href="#sec-4-4">4.4 深化和拓宽</a></li>
<li><a href="#sec-4-5">4.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-4-6">4.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-5">5 advanced linux programming</a>
<ul>
<li><a href="#sec-5-1">5.1 教学目标及基本要求</a></li>
<li><a href="#sec-5-2">5.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1 Program library (1h)</a>
<ul>
<li><a href="#sec-5-2-1-1">5.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-5-2-1-2">5.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-5-2-2">5.2.2 Linux assembly (1h)</a>
<ul>
<li><a href="#sec-5-2-2-1">5.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-5-2-2-2">5.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-5-2-3">5.2.3 NCURSES programming (2h)</a>
<ul>
<li><a href="#sec-5-2-3-1">5.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-5-2-3-2">5.2.3.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5-3">5.3 重点和难点</a></li>
<li><a href="#sec-5-4">5.4 深化和拓宽</a></li>
<li><a href="#sec-5-5">5.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-5-6">5.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Popular software tools in Linux</a>
<ul>
<li><a href="#sec-6-1">6.1 教学目标及基本要求</a></li>
<li><a href="#sec-6-2">6.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1 Graphical IDE (2h)</a>
<ul>
<li><a href="#sec-6-2-1-1">6.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-6-2-1-2">6.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-6-2-2">6.2.2 Image processing (1h)</a>
<ul>
<li><a href="#sec-6-2-2-1">6.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-6-2-2-2">6.2.2.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-6-2-3">6.2.3 Command line tools (1h)</a>
<ul>
<li><a href="#sec-6-2-3-1">6.2.3.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-6-2-3-2">6.2.3.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-6-2-4">6.2.4 Graph drawing</a>
<ul>
<li><a href="#sec-6-2-4-1">6.2.4.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-6-2-4-2">6.2.4.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3 重点和难点</a></li>
<li><a href="#sec-6-4">6.4 深化和拓宽</a></li>
<li><a href="#sec-6-5">6.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-6-6">6.6 思考题和习题</a></li>
</ul>
</li>
<li><a href="#sec-7">7 Linux networking</a>
<ul>
<li><a href="#sec-7-1">7.1 教学目标及基本要求</a></li>
<li><a href="#sec-7-2">7.2 教学内容及学时分配</a>
<ul>
<li><a href="#sec-7-2-1">7.2.1 Basic commands (1h)</a>
<ul>
<li><a href="#sec-7-2-1-1">7.2.1.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-7-2-1-2">7.2.1.2 教学方式（手段）</a></li>
</ul>
</li>
<li><a href="#sec-7-2-2">7.2.2 Advanced tools (3h)</a>
<ul>
<li><a href="#sec-7-2-2-1">7.2.2.1 教学内容（具体到知识点）</a></li>
<li><a href="#sec-7-2-2-2">7.2.2.2 教学方式（手段）</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7-3">7.3 重点和难点</a></li>
<li><a href="#sec-7-4">7.4 深化和拓宽</a></li>
<li><a href="#sec-7-5">7.5 教学方式（手段）及教学过程中应注意的问题</a></li>
<li><a href="#sec-7-6">7.6 思考题和习题</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Linux introduction</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-1-1">

<p>   了解什么是Linux, GNU, Opensource
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li><a href="./linux_intro/linux_intro.pdf">幻灯片</a>
</li>
</ul>


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> What's GNU/Linux? (0.5h)</h4>
<div class="outline-text-4" id="text-1-2-1">


</div>

<div id="outline-container-1-2-1-1" class="outline-5">
<h5 id="sec-1-2-1-1"><span class="section-number-5">1.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-1-2-1-1">

<ul>
<li>What's Linux?
</li>
<li>What's GNU?
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-1-2" class="outline-5">
<h5 id="sec-1-2-1-2"><span class="section-number-5">1.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-1-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Opensource history and future (0.5h)</h4>
<div class="outline-text-4" id="text-1-2-2">


</div>

<div id="outline-container-1-2-2-1" class="outline-5">
<h5 id="sec-1-2-2-1"><span class="section-number-5">1.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-1-2-2-1">

<ul>
<li>What's opensource?
</li>
<li>History and future
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-2-2" class="outline-5">
<h5 id="sec-1-2-2-2"><span class="section-number-5">1.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-1-2-2-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>What's GNU/Linux
</li>
<li>Opensource
</li>
</ul>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-1-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-1-5">

<ul>
<li>理论 + 实验
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Play with bash</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-2-1">

<p>   了解基本的命令行操作和shell编程
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li><a href="./bash/shell_basics.html">讲义</a>
</li>
<li><a href="./linux_lectures/">幻灯片</a>
</li>
</ul>


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> UNIX file system (1h)</h4>
<div class="outline-text-4" id="text-2-2-1">


</div>

<div id="outline-container-2-2-1-1" class="outline-5">
<h5 id="sec-2-2-1-1"><span class="section-number-5">2.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-1-1">

<ul>
<li>UNIX file system structure
</li>
<li>basic commands
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-1-2" class="outline-5">
<h5 id="sec-2-2-1-2"><span class="section-number-5">2.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Terminal operations (.5h)</h4>
<div class="outline-text-4" id="text-2-2-2">


</div>

<div id="outline-container-2-2-2-1" class="outline-5">
<h5 id="sec-2-2-2-1"><span class="section-number-5">2.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-2-1">

<ul>
<li>CLI shortcuts
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-2-2" class="outline-5">
<h5 id="sec-2-2-2-2"><span class="section-number-5">2.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> File operations (1h)</h4>
<div class="outline-text-4" id="text-2-2-3">


</div>

<div id="outline-container-2-2-3-1" class="outline-5">
<h5 id="sec-2-2-3-1"><span class="section-number-5">2.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-3-1">

<ul>
<li>understanding <code>ls</code> output
</li>
<li>copy, move, delete, view, link
</li>
<li>cat
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-3-2" class="outline-5">
<h5 id="sec-2-2-3-2"><span class="section-number-5">2.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-3-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> Shell basics (1h)</h4>
<div class="outline-text-4" id="text-2-2-4">


</div>

<div id="outline-container-2-2-4-1" class="outline-5">
<h5 id="sec-2-2-4-1"><span class="section-number-5">2.2.4.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-4-1">

<ul>
<li>Help
</li>
<li>Path
</li>
<li>Initial files
</li>
<li>Special files
</li>
<li>Special characters
</li>
<li>Search
</li>
<li>Alias
</li>
</ul>

</div>

</div>
