linux/paperwork/unit-plan.org
*** Bash programming (4h)
**** 教学内容（具体到知识点）
     - =for ...; do ...; done= loop
     - =while ...; do ...; done= loop
     - =if ...; then ...; else ...; fi=
     - =case VAR in PATTERN) COMMANDS;; esac=
     - =read=
     - Arrays
     - GUI
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Sed, Awk (2h)
**** 教学内容（具体到知识点）
     - Sed
     - Awk
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - UNIX file system
   - PATH
   - shell programming
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
* Classical Linux IDE
** 教学目标及基本要求
   了解Linux下的经典开发环境
** 教学内容及学时分配
  - [[./c/c_dev.html][讲义]]
  - [[./linux_lectures/][幻灯片]]
*** From c source code to executable (1h)
**** 教学内容（具体到知识点）
     - c pre-processor
     - Compiler
     - Assembler
     - Linker
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Emacs + GCC + GDB (2h)
**** 教学内容（具体到知识点）
     - emacs
     - gcc
     - gdb
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** make and version control (2.5h)
**** 教学内容（具体到知识点）
     - makefile
     - git
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - from c source code to executable
   - makefile
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
* system administration
** 教学目标及基本要求
   了解基本的系统管理操作
** 教学内容及学时分配
   - [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/linux/admin.html][讲义]]
   - [[http://cs2.swfu.edu.cn/~wx672/lecture_notes/linux/account.html][作业]]
*** debian/ubuntu package management (2h)
**** 教学内容（具体到知识点）
     - sources.list
     - apt
     - aptitude
     - dpkg
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** system maintenance (2h)
**** 教学内容（具体到知识点）
     - user account management
     - system security
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - sources.list
   - apt
   - server maintenance
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
* advanced linux programming 
** 教学目标及基本要求
   了解linux下的高级编程技术
** 教学内容及学时分配
  - 讲义
    - [[http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id%3d1175][advanced linux programming]]
    - [[http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id%3d1176][program library howto]]
    - [[http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id%3d1197][linux assembly howto]]
    - [[http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id%3D1198][NCURSES programming HOWTO]]
*** Program library (1h)
**** 教学内容（具体到知识点）
     - Libraries introduction
     - Linking
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Linux assembly (1h)
**** 教学内容（具体到知识点）
     - Intel vs. AT\&T
     - GAS
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** NCURSES programming (2h)
**** 教学内容（具体到知识点）
     - Ncurses intro
     - Examples
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - Library
   - GAS
   - Ncurses
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
