linux/paperwork/unit-plan.html

<div id="outline-container-2-2-4-2" class="outline-5">
<h5 id="sec-2-2-4-2"><span class="section-number-5">2.2.4.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-4-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> Bash programming (4h)</h4>
<div class="outline-text-4" id="text-2-2-5">


</div>

<div id="outline-container-2-2-5-1" class="outline-5">
<h5 id="sec-2-2-5-1"><span class="section-number-5">2.2.5.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-5-1">

<ul>
<li><code>for ...; do ...; done</code> loop
</li>
<li><code>while ...; do ...; done</code> loop
</li>
<li><code>if ...; then ...; else ...; fi</code>
</li>
<li><code>case VAR in PATTERN) COMMANDS;; esac</code>
</li>
<li><code>read</code>
</li>
<li>Arrays
</li>
<li>GUI
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-5-2" class="outline-5">
<h5 id="sec-2-2-5-2"><span class="section-number-5">2.2.5.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-5-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4">2.2.6</span> Sed, Awk (2h)</h4>
<div class="outline-text-4" id="text-2-2-6">


</div>

<div id="outline-container-2-2-6-1" class="outline-5">
<h5 id="sec-2-2-6-1"><span class="section-number-5">2.2.6.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-2-2-6-1">

<ul>
<li>Sed
</li>
<li>Awk
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2-6-2" class="outline-5">
<h5 id="sec-2-2-6-2"><span class="section-number-5">2.2.6.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-2-2-6-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-2-3">

<ul>
<li>UNIX file system
</li>
<li>PATH
</li>
<li>shell programming
</li>
</ul>

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-2-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-2-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-2-6">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Classical Linux IDE</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-3-1">

<p>   了解Linux下的经典开发环境
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li><a href="./c/c_dev.html">讲义</a>
</li>
<li><a href="./linux_lectures/">幻灯片</a>
</li>
</ul>


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> From c source code to executable (1h)</h4>
<div class="outline-text-4" id="text-3-2-1">


</div>

<div id="outline-container-3-2-1-1" class="outline-5">
<h5 id="sec-3-2-1-1"><span class="section-number-5">3.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-1-1">

<ul>
<li>c pre-processor
</li>
<li>Compiler
</li>
<li>Assembler
</li>
<li>Linker
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-1-2" class="outline-5">
<h5 id="sec-3-2-1-2"><span class="section-number-5">3.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Emacs + GCC + GDB (2h)</h4>
<div class="outline-text-4" id="text-3-2-2">


</div>

<div id="outline-container-3-2-2-1" class="outline-5">
<h5 id="sec-3-2-2-1"><span class="section-number-5">3.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-2-1">

<ul>
<li>emacs
</li>
<li>gcc
</li>
<li>gdb
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-2-2" class="outline-5">
<h5 id="sec-3-2-2-2"><span class="section-number-5">3.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> make and version control (2.5h)</h4>
<div class="outline-text-4" id="text-3-2-3">


</div>

<div id="outline-container-3-2-3-1" class="outline-5">
<h5 id="sec-3-2-3-1"><span class="section-number-5">3.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-3-2-3-1">

<ul>
<li>makefile
</li>
<li>git
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2-3-2" class="outline-5">
<h5 id="sec-3-2-3-2"><span class="section-number-5">3.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-3-2-3-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-3-3">

<ul>
<li>from c source code to executable
</li>
<li>makefile
</li>
</ul>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-3-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-3-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-3-6">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> system administration</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-4-1">

<p>   了解基本的系统管理操作
</p></div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/linux/admin.html">讲义</a>
</li>
<li><a href="http://cs2.swfu.edu.cn/~wx672/lecture_notes/linux/account.html">作业</a>
</li>
</ul>


</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> debian/ubuntu package management (2h)</h4>
<div class="outline-text-4" id="text-4-2-1">


</div>

<div id="outline-container-4-2-1-1" class="outline-5">
<h5 id="sec-4-2-1-1"><span class="section-number-5">4.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-4-2-1-1">

<ul>
<li>sources.list
</li>
<li>apt
</li>
<li>aptitude
</li>
<li>dpkg
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2-1-2" class="outline-5">
<h5 id="sec-4-2-1-2"><span class="section-number-5">4.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-4-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> system maintenance (2h)</h4>
<div class="outline-text-4" id="text-4-2-2">


</div>

<div id="outline-container-4-2-2-1" class="outline-5">
<h5 id="sec-4-2-2-1"><span class="section-number-5">4.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-4-2-2-1">

<ul>
<li>user account management
</li>
<li>system security
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2-2-2" class="outline-5">
<h5 id="sec-4-2-2-2"><span class="section-number-5">4.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-4-2-2-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li>sources.list
</li>
<li>apt
</li>
<li>server maintenance
</li>
</ul>

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-4-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-4-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-4-6">

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> advanced linux programming</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-5-1">

<p>   了解linux下的高级编程技术
</p></div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li>讲义
<ul>
<li><a href="http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id=1175">advanced linux programming</a>
</li>
<li><a href="http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id=1176">program library howto</a>
</li>
<li><a href="http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id=1197">linux assembly howto</a>
</li>
<li><a href="http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id=1198">NCURSES programming HOWTO</a>
</li>
</ul>

</li>
</ul>


</div>

<div id="outline-container-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Program library (1h)</h4>
<div class="outline-text-4" id="text-5-2-1">


</div>

<div id="outline-container-5-2-1-1" class="outline-5">
<h5 id="sec-5-2-1-1"><span class="section-number-5">5.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-5-2-1-1">

<ul>
<li>Libraries introduction
</li>
<li>Linking
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2-1-2" class="outline-5">
<h5 id="sec-5-2-1-2"><span class="section-number-5">5.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-5-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> Linux assembly (1h)</h4>
<div class="outline-text-4" id="text-5-2-2">


</div>

<div id="outline-container-5-2-2-1" class="outline-5">
<h5 id="sec-5-2-2-1"><span class="section-number-5">5.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-5-2-2-1">

<ul>
<li>Intel vs. AT\&amp;T
</li>
<li>GAS
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2-2-2" class="outline-5">
<h5 id="sec-5-2-2-2"><span class="section-number-5">5.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-5-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="section-number-4">5.2.3</span> NCURSES programming (2h)</h4>
<div class="outline-text-4" id="text-5-2-3">


</div>
