linux/paperwork/unit-plan.org
* Popular software tools in Linux 
** 教学目标及基本要求
   了解Linux平台下的常用软件
** 教学内容及学时分配
   - [[http://cs2/cgi-bin/dwww/usr/share/doc/qt4-doc-html/html/tutorials.html][讲义]]
*** Graphical IDE (2h)
**** 教学内容（具体到知识点）
     - Qt designer
     - Eclipse       
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Image processing (1h)
**** 教学内容（具体到知识点）
     - Imagemagick 
     - GIMP
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Command line tools (1h)
**** 教学内容（具体到知识点）
     - ssh/scp
     - lynx/curl
     - mutt/mailx
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Graph drawing
**** 教学内容（具体到知识点）
     - Dia
     - Xfig
     - umbrello
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - Qt designer
   - Eclipse
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题
* Linux networking
** 教学目标及基本要求
   了解基本的Linux网络操作命令
** 教学内容及学时分配
  - [[http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id%3D1178][讲义]]
  - [[./iptables.pdf][幻灯片]]
*** Basic commands (1h)
**** 教学内容（具体到知识点）
     - ifconfig
     - ping
     - route
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
*** Advanced tools (3h)
**** 教学内容（具体到知识点）
     - netcat
     - nmap
     - tcpdump
     - iptables
**** 教学方式（手段）
     理论 + 实验
**** 师生活动设计						   :noexport:
** 重点和难点
   - Advanced tools
** 深化和拓宽
   暂无
** 教学方式（手段）及教学过程中应注意的问题
   理论 + 实验
** 参考书目							   :noexport:
** 思考题和习题

# #+BIBLIOGRAPHY: os plain limit:t option:-u
   
#+BEGIN_LaTeX
\bibliographystyle{plain}
\bibliography{os}
#+END_LaTeX
   
