linux/paperwork/unit-plan.html

<div id="outline-container-5-2-3-1" class="outline-5">
<h5 id="sec-5-2-3-1"><span class="section-number-5">5.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-5-2-3-1">

<ul>
<li>Ncurses intro
</li>
<li>Examples
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2-3-2" class="outline-5">
<h5 id="sec-5-2-3-2"><span class="section-number-5">5.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-5-2-3-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-5-3">

<ul>
<li>Library
</li>
<li>GAS
</li>
<li>Ncurses
</li>
</ul>

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-5-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-5-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-5-6">

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Popular software tools in Linux</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-6-1">

<p>   了解Linux平台下的常用软件
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-6-2">

<ul>
<li><a href="http://cs2/cgi-bin/dwww/usr/share/doc/qt4-doc-html/html/tutorials.html">讲义</a>
</li>
</ul>


</div>

<div id="outline-container-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> Graphical IDE (2h)</h4>
<div class="outline-text-4" id="text-6-2-1">


</div>

<div id="outline-container-6-2-1-1" class="outline-5">
<h5 id="sec-6-2-1-1"><span class="section-number-5">6.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-6-2-1-1">

<ul>
<li>Qt designer
</li>
<li>Eclipse       
</li>
</ul>

</div>

</div>

<div id="outline-container-6-2-1-2" class="outline-5">
<h5 id="sec-6-2-1-2"><span class="section-number-5">6.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-6-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> Image processing (1h)</h4>
<div class="outline-text-4" id="text-6-2-2">


</div>

<div id="outline-container-6-2-2-1" class="outline-5">
<h5 id="sec-6-2-2-1"><span class="section-number-5">6.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-6-2-2-1">

<ul>
<li>Imagemagick 
</li>
<li>GIMP
</li>
</ul>

</div>

</div>

<div id="outline-container-6-2-2-2" class="outline-5">
<h5 id="sec-6-2-2-2"><span class="section-number-5">6.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-6-2-2-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> Command line tools (1h)</h4>
<div class="outline-text-4" id="text-6-2-3">


</div>

<div id="outline-container-6-2-3-1" class="outline-5">
<h5 id="sec-6-2-3-1"><span class="section-number-5">6.2.3.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-6-2-3-1">

<ul>
<li>ssh/scp
</li>
<li>lynx/curl
</li>
<li>mutt/mailx
</li>
</ul>

</div>

</div>

<div id="outline-container-6-2-3-2" class="outline-5">
<h5 id="sec-6-2-3-2"><span class="section-number-5">6.2.3.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-6-2-3-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-6-2-4" class="outline-4">
<h4 id="sec-6-2-4"><span class="section-number-4">6.2.4</span> Graph drawing</h4>
<div class="outline-text-4" id="text-6-2-4">


</div>

<div id="outline-container-6-2-4-1" class="outline-5">
<h5 id="sec-6-2-4-1"><span class="section-number-5">6.2.4.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-6-2-4-1">

<ul>
<li>Dia
</li>
<li>Xfig
</li>
<li>umbrello
</li>
</ul>

</div>

</div>

<div id="outline-container-6-2-4-2" class="outline-5">
<h5 id="sec-6-2-4-2"><span class="section-number-5">6.2.4.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-6-2-4-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-6-3">

<ul>
<li>Qt designer
</li>
<li>Eclipse
</li>
</ul>

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-6-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-6-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-6-6">

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Linux networking</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 教学目标及基本要求</h3>
<div class="outline-text-3" id="text-7-1">

<p>   了解基本的Linux网络操作命令
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 教学内容及学时分配</h3>
<div class="outline-text-3" id="text-7-2">

<ul>
<li><a href="http://cs3.swfu.edu.cn/moodle/mod/resource/view.php?id=1178">讲义</a>
</li>
<li><a href="./iptables.pdf">幻灯片</a>
</li>
</ul>


</div>

<div id="outline-container-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> Basic commands (1h)</h4>
<div class="outline-text-4" id="text-7-2-1">


</div>

<div id="outline-container-7-2-1-1" class="outline-5">
<h5 id="sec-7-2-1-1"><span class="section-number-5">7.2.1.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-7-2-1-1">

<ul>
<li>ifconfig
</li>
<li>ping
</li>
<li>route
</li>
</ul>

</div>

</div>

<div id="outline-container-7-2-1-2" class="outline-5">
<h5 id="sec-7-2-1-2"><span class="section-number-5">7.2.1.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-7-2-1-2">

<p>     理论 + 实验
</p></div>
</div>

</div>

<div id="outline-container-7-2-2" class="outline-4">
<h4 id="sec-7-2-2"><span class="section-number-4">7.2.2</span> Advanced tools (3h)</h4>
<div class="outline-text-4" id="text-7-2-2">


</div>

<div id="outline-container-7-2-2-1" class="outline-5">
<h5 id="sec-7-2-2-1"><span class="section-number-5">7.2.2.1</span> 教学内容（具体到知识点）</h5>
<div class="outline-text-5" id="text-7-2-2-1">

<ul>
<li>netcat
</li>
<li>nmap
</li>
<li>tcpdump
</li>
<li>iptables
</li>
</ul>

</div>

</div>

<div id="outline-container-7-2-2-2" class="outline-5">
<h5 id="sec-7-2-2-2"><span class="section-number-5">7.2.2.2</span> 教学方式（手段）</h5>
<div class="outline-text-5" id="text-7-2-2-2">

<p>     理论 + 实验
</p></div>
</div>
</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 重点和难点</h3>
<div class="outline-text-3" id="text-7-3">

<ul>
<li>Advanced tools
</li>
</ul>

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 深化和拓宽</h3>
<div class="outline-text-3" id="text-7-4">

<p>   暂无
</p></div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> 教学方式（手段）及教学过程中应注意的问题</h3>
<div class="outline-text-3" id="text-7-5">

<p>   理论 + 实验
</p></div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> 思考题和习题</h3>
<div class="outline-text-3" id="text-7-6">




</div>
</div>
</div>
</div>

<div id="postamble">
<p class="author">Author: 王晓林 (<a href="mailto:wx672ster@gmail.com">wx672ster@gmail.com</a>)</p>
<p class="date">Date: 2012-08-18 Wed</p>

</div>
</body>
</html>
